EA/src/InformationRegisters/НастройкиПрайсовПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПрайсовПоставщиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>have_field_names</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолВУпаковке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЕГК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Баркод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаПроизводитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖВЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальнаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУстанавливатьМинКол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/НастройкиПрайсовПоставщиков/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСтрокуНастройкиЗагрузок");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Если ПустаяСтрока(Запись.Формат) Тогда
		ПоказатьПредупреждение(, "Не указан формат загружаемого прайса поставщика", 20);
		Возврат;
	КонецЕсли;
	
	
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоляПоУмолчанию", ЭтотОбъект),
    	"Заполнить поля данными по умолчанию?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляПоУмолчанию(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ВРег(СокрЛП(Запись.Формат)) = "DBF" Тогда

		Запись.Маска = "*.dbf";
		Запись.Кодировка = "CP866";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "CODEPST";
		Запись.Название = "NAME";
		Запись.Производитель = "FIRM";
		Запись.СтранаПроизводитель = "CNTR";
		Запись.Баркод = "EAN13";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "QNTPACK";
		Запись.КодЕГК = "";
		Запись.Остаток = "QNT";
		Запись.Цена = "PRICE1";
		Запись.ЦенаРег = "PRICEGR";
		Запись.СтавкаНДС = "NDS";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "GDATE";
		Запись.Дата = "";
		Запись.ЖВЛ = "GNVLS";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "TXT" Тогда

		Запись.Маска = "*.txt";
		Запись.Кодировка = "Windows-1251";
		Запись.Разделитель = "|";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "0";
		Запись.Название = "1";
		Запись.Производитель = "2";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "9";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "6";
		Запись.КодЕГК = "";
		Запись.Остаток = "4";
		Запись.Цена = "3";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "7";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "8";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "ZIPPROTEK" Тогда

		Запись.Маска = "*.zip";
		Запись.Кодировка = "UTF8";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "Ид";
		Запись.Название = "Наименование";
		Запись.Производитель = "Изготовитель|ОфициальноеНаименование";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "ЗначенияСвойств|MIN_QTY_CONTROL";
		Запись.КодЕГК = "ЗначенияСвойств|CD_EGK";
		Запись.Остаток = "Количество";
		Запись.Цена = "Цены|Цена|ЦенаЗаЕдиницу";
		Запись.ЦенаРег = "ЗначенияСвойств|REG_GOS_PRICE";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "ЗначенияСвойств|EXP_DATE";
		Запись.Дата = "";
		Запись.ЖВЛ = "";
		
	Иначе
		
		ПоказатьПредупреждение(, "Автоматическое заполнение данного формата не предусмотрено.
		|Заполните имена полей самостоятельно.", 20);
		
		Запись.Маска = "*." + НРег(СокрЛП(Запись.Формат));
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "";
		Запись.Название = "";
		Запись.Производитель = "";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "";
		Запись.КодЕГК = "";
		Запись.Остаток = "";
		Запись.Цена = "";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "";

	КонецЕсли; 

	
КонецПроцедуры
